<a href="https://colab.research.google.com/github/Gaukhar-ai/DecisionTree/blob/master/chicago_salary_dask.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#!pip install aiohttp
!pip install dask[dataframe] --upgrade

In [7]:
import dask.dataframe as dd
chicago = dd.read_csv('https://raw.githubusercontent.com/Gaukhar-ai/for_my_Thinkful_work/master/datas/Current_Employee_Names__Salaries__and_Position_Titles%20(3).csv')

In [8]:
chicago.head()

               Name      Job Titles  ... Annual Salary Hourly Rate
0  ALLISON,  PAUL W      LIEUTENANT  ...    $107790.00         NaN
1   BRUNO,  KEVIN D        SERGEANT  ...    $104628.00         NaN
2   COOPER,  JOHN E  LIEUTENANT-EMT  ...    $114324.00         NaN
3  CRESPO,  VILMA I      STAFF ASST  ...     $76932.00         NaN
4  DOLAN,  ROBERT J        SERGEANT  ...    $111474.00         NaN

[5 rows x 8 columns]

In [9]:
chicago_salary=chicago[chicago['Salary or Hourly']=='Salary']

In [10]:
chicago_salary.head()

               Name      Job Titles  ... Annual Salary Hourly Rate
0  ALLISON,  PAUL W      LIEUTENANT  ...    $107790.00         NaN
1   BRUNO,  KEVIN D        SERGEANT  ...    $104628.00         NaN
2   COOPER,  JOHN E  LIEUTENANT-EMT  ...    $114324.00         NaN
3  CRESPO,  VILMA I      STAFF ASST  ...     $76932.00         NaN
4  DOLAN,  ROBERT J        SERGEANT  ...    $111474.00         NaN

[5 rows x 8 columns]

In [14]:
chicago_salary.compute()

                        Name               Job Titles  ... Annual Salary Hourly Rate
0           ALLISON,  PAUL W               LIEUTENANT  ...    $107790.00         NaN
1            BRUNO,  KEVIN D                 SERGEANT  ...    $104628.00         NaN
2            COOPER,  JOHN E           LIEUTENANT-EMT  ...    $114324.00         NaN
3           CRESPO,  VILMA I               STAFF ASST  ...     $76932.00         NaN
4           DOLAN,  ROBERT J                 SERGEANT  ...    $111474.00         NaN
...                      ...                      ...  ...           ...         ...
32653     ZYGOWICZ,  PETER J           POLICE OFFICER  ...     $90024.00         NaN
32654  ZYLINSKA,  KATARZYNA            POLICE OFFICER  ...     $48078.00         NaN
32655      ZYMANTAS,  MARK E           POLICE OFFICER  ...     $87006.00         NaN
32656    ZYRKOWSKI,  CARLO E           POLICE OFFICER  ...     $93354.00         NaN
32657   ZYSKOWSKI,  DARIUSZ   CHIEF DATA BASE ANALYST  ...    $115932.00         NaN

[24775 rows x 8 columns]

In [11]:
chicago.npartitions

1

In [15]:
chicago = dd.read_csv('https://raw.githubusercontent.com/Gaukhar-ai/for_my_Thinkful_work/master/datas/Current_Employee_Names__Salaries__and_Position_Titles%20(3).csv')

In [16]:
chicago_indexed = chicago.set_index('Job Titles')

In [18]:
chicago_indexed.divisions

('1ST DEPUTY INSPECTOR GENERAL', 'ZONING PLAN EXAMINER')

In [ ]:
chicago

In [20]:
chicago_salary['Annual Salary'] = chicago_salary['Annual Salary'].str.replace('$', '').astype(float)

In [21]:
chicago_salary.head()

               Name      Job Titles  ... Annual Salary Hourly Rate
0  ALLISON,  PAUL W      LIEUTENANT  ...      107790.0         NaN
1   BRUNO,  KEVIN D        SERGEANT  ...      104628.0         NaN
2   COOPER,  JOHN E  LIEUTENANT-EMT  ...      114324.0         NaN
3  CRESPO,  VILMA I      STAFF ASST  ...       76932.0         NaN
4  DOLAN,  ROBERT J        SERGEANT  ...      111474.0         NaN

[5 rows x 8 columns]

In [ ]:
#if it was a string still with a $ sign, can use this code too
#chicago_salary['Annual Salary'].apply(lambda x: x.replace('$', '')).astype(float)